---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..ToggleViewFailures Members
BuiltInFailures..::..ToggleViewFailures Class Properties See Also Send Feedback
---

Provides a container of all Revit built-in FailureDefinitionId instances.

The BuiltInFailures..::..ToggleViewFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | LoseSavedOrientation | The stored orientation will be lost. |

# See Also

BuiltInFailures..::..ToggleViewFailures Class

Autodesk.Revit.DB Namespace